
#Задача 1
# Объяви переменную с именем count и присвой ей значение 15.
# Затем объяви переменную item_name и присвой ей строковое значение "карандаш".
# Выведи на экран тип данных переменной item_name.

count = 15
item_name = "карандаш"

print(type(item_name))

# Задача 2
# Напиши код, который выполняет следующие действия:
# Создает переменную a со значением 10.
# Создает переменную b со значением 3.
# Выводит на экран результат целочисленного деления a на b

a = 10
b = 3

print(a // b)


#Задача 3
# У тебя есть две переменные:
# num_str = "123"
# num_int = 456
# Преобразуй переменную num_str в целое число, преобразуй переменную num_int в строку,
# а затем выведи на экран сумму преобразованного числа из num_str и числа num_int

num_str = "123"
num_int = 456

converted_num = int(num_str)
converted_str = str(num_int)

print(converted_num + num_int)

